# Счастливый билет
n = int(input("Введите число : "))
if n < 100000:
    print ("Введите больше чисел")
else: 
    b1 = n // 1000  # xxx***
    b2 = n % 1000   # ***yyy
    
    b1c = b1 % 10   #**x
    b1 = b1 // 10   #**
    b1b = b1 % 10   #*x
    b1 = b1 // 10   #x

    b2c = b2 % 10   #**y
    b2 = b2 // 10   #**
    b2b = b2 % 10   #*y
    b2 = b2 // 10   #y

    x = b1 + b1b + b1c  #x+x+x***
    y = b2 + b2b + b2c  #***y+y+y
if x == y:
    print ("Счастливое число!")
else:
    print("Не счастливое число(")